app/controllers/card_controller.rb

  def new
    card = Card.where(user_id: current_user.id)
    redirect_to action: "show" if card.exists?
---
SELECT  1 AS one FROM "cards" WHERE "cards"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

  def pay #payjpとCardのデータベース作成を実施します。
    Payjp.api_key = ENV["PAYJP_PRIVATE_KEY"]
    ###binding.pry
    if params['payjp-token'].blank?
      redirect_to action: "new"
    else
      customer = Payjp::Customer.create(
      description: '登録テスト', #なくてもOK
      email: current_user.email, #なくてもOK
      card: params['payjp-token'],
      metadata: {user_id: current_user.id}
      ) #念の為metadataにuser_idを入れましたがなくてもOK
      @card = Card.new(user_id: current_user.id, customer_id: customer.id, card_id: customer.default_card)
      if @card.save
---
INSERT INTO "cards" ("user_id", "customer_id", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def show
    card = Card.where(user_id: current_user.id).first
---
SELECT  "cards".* FROM "cards" WHERE "cards"."user_id" = $1 ORDER BY "cards"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]